
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ут_Трудозатраты 
	Движения.ут_Трудозатраты.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ут_Трудозатраты.Добавить();
		Движение.Период = Дата;
		Движение.Подзадача = ТекСтрокаЗатраты.Подзадача;
		Движение.Факт = ТекСтрокаЗатраты.Факт;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
