
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Уровни.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ут_Уровни.Ссылка КАК Уровень
	               |ИЗ
	               |	Справочник.ут_Уровни КАК ут_Уровни
	               |ГДЕ
	               |	ут_Уровни.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ут_Уровни.Номер";
	
	РезЗапроса = Запрос.Выполнить();
	Табл = РезЗапроса.Выгрузить();
	
	Объект.Уровни.Загрузить(Табл);
	
КонецПроцедуры
