
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.Нормы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ут_Месяцы.Ссылка КАК Месяц
	               |ИЗ
	               |	Справочник.ут_Месяцы КАК ут_Месяцы
	               |ГДЕ
	               |	ут_Месяцы.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ут_Месяцы.Номер";
	
	РезЗапроса = Запрос.Выполнить();
	Табл = РезЗапроса.Выгрузить();
	
	Объект.Нормы.Загрузить(Табл);
КонецПроцедуры
